def map_income(row):
    """
    日记账收入
    转收入账格式
    """

    return {

        "年": row["年"],

        "月": row["月"],

        "日": row["日"],

        "摘要": row["摘要"],

        "明细摘要": row["明细摘要"],

        "收入": row["收入"],

        "业务类别": row["对方科目"]

    }



def map_expense(row):
    """
    日记账支出
    转支出账格式
    """

    return {

        "年": row["年"],

        "月": row["月"],

        "日": row["日"],

        "摘要": row["摘要"],

        "明细摘要": row["明细摘要"],

        "支出": row["支出"],

        "业务类别": row["对方科目"]

    }